/*************************************************************************************************
 * @file		ff_addons.c
 *
 * @brief		Дополнения для драйвера SD
 *
 * @version		v1.0
 * @date		05.09.2013
 * @author		Mike Smith
 *
 ************************************************************************************************/

//*-----------------------------------------------------------------------------------------------
//*			Подключаемые внешние модули
//*-----------------------------------------------------------------------------------------------

#include "driver/integer.h"
#include "driver/ff_addons.h"

#include "ets_sys.h"
#include "osapi.h"
//#include "uart.h"
#include "os_type.h"
//*-----------------------------------------------------------------------------------------------
//*			Внешние функции
//*-----------------------------------------------------------------------------------------------
//extern void disk_timerproc(void);



//*-----------------------------------------------------------------------------------------------
/**			Настройка и запуск таймера
 *
 * @return результат выполнения функции (0 - ок, -1 - ошибка, таймер не создан)					*/
//*-----------------------------------------------------------------------------------------------
int ICACHE_FLASH_ATTR ff_timer_init(void)
{
	/* Ещё один косяк модуля sd_spi_stm32.c:
	 * порты микроконтроллера, отвечающие за контроль карты памяти,
	 * инициализируются в функции power_on(), вызываемым в свою очередь
	 * из функции disk_initialize() уже ПОСЛЕ проверки состояния этих пинов.
	 * Обычно после сброса контроллера порты настраиваются на ввод, поэтому
	 * эта логическая ошибка проблем не вызывает.
	 * Необходимо принудительно инициалировать порты:
	 */
	//init_timer();
	return 0;
}


//*-----------------------------------------------------------------------------------------------
/**			Возврат текущего системного времени
 *
 * @return - время, 32-битное слово в формате времени FAT (см. тип fat_time_t)					*/
//*-----------------------------------------------------------------------------------------------
DWORD ICACHE_FLASH_ATTR get_fattime(void)
{
	// возвращаем константное время
	return
			((DWORD)(2013 - 1980) << 25)
			| ((DWORD)9 << 21)
			| ((DWORD)4 << 16)
			| ((DWORD)12 << 11)
			| ((DWORD)0 << 5)
			| ((DWORD)0 >> 1);

	// а так будет гораздо нагляднее:
	/*
	union
	{
		fat_time_t fat_time;
		DWORD dword;
	} time;

	time.fat_time.sec = 0;
	time.fat_time.min = 0;
	time.fat_time.hour = 12;
	time.fat_time.day = 4;
	time.fat_time.month = 9;
	time.fat_time.year = 2013-1980;

	return time.dword;
*/
}
