/*************************************************************************************************
 * @file		ff_addons.c
 *
 * @brief		Заголовок модуля дополнительных функций для драйвера SD
 *
 * @version		v1.0
 * @date		05.09.2013
 * @author		Mike Smith
 *
 ************************************************************************************************/
#ifndef FF_ADDONS_H_
#define FF_ADDONS_H_


// описание структуры времени FAT
typedef struct
{
	DWORD 	sec: 	5;	// биты 0-4, 1 ед. = 2 сек
	DWORD	min:	6;	// биты 5-10
	DWORD	hour:	5;	// биты 11-15
	DWORD	day:	5;	// биты 16-20
	DWORD	month:	4;	// биты 21-24
	DWORD	year:	7;	// биты 25-31
} fat_time_t;


//*-----------------------------------------------------------------------------------------------
//*			Функции модуля
//*-----------------------------------------------------------------------------------------------
int ff_timer_init(void);	// инициализация таймера
DWORD get_fattime(void);	// вернуть системное время


#endif /* FF_ADDONS_H_ */
